vyng/tsung/vyngTsung.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="warning">

  <clients>
    <client host="localhost" cpu="2" maxusers="100"/>
  </clients>

  <servers>
    <server host="http://api-dev.vyng.me/" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="vyng_load" weight="1" type="ts_http">
      <request>
      <http url="api/media/channels?limit=5""
              method="GET"
              contents_from_file="query.json" />
      </request>
    </session>
  </sessions>
</tsung>